src/main/resources/test.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:srv="http://srv.camrgo.com">
    <soapenv:Header/>
    <soapenv:Body>
        <srv:getReading>
            <arg0>
                {"companycode":"0126","data":[{"data_dt":"20210829","datavalue":"0.14400","customerno":"00074535"},{"data_dt":"20210830","datavalue":"0.14400","customerno":"00074535"},{"data_dt":"20210831","datavalue":"0.14400","customerno":"00074535"},{"data_dt":"20210901","datavalue":"0.14400","customerno":"00074535"},{"data_dt":"20210902","datavalue":"0.14400","customerno":"00074535"},{"data_dt":"20210903","datavalue":"0.14400","customerno":"00074535"},{"data_dt":"20210905","datavalue":"0.14400","customerno":"00074535"}]}
            </arg0>
        </srv:getReading>
    </soapenv:Body>
</soapenv:Envelope>
